function xfinal=nonlinsolver_n()
%=========================================================
% Å£¶Ù·¨
% ²âÊÔÓÃÀý
% Àý£ºx.^3-6*x.^2+9*x-2=0;
%=========================================================  
f=@(x)(x.^3-6*x.^2+9*x-2);
g=@(x)(3*x.^2-12*x+9);
xinit=3.5;
ep=1d-4;

x0 =xinit;
x1 = x0+1+ep;                                             
error = x1-x0;  
while abs(error) > ep                          
    x1 = x0 - f(x0)/g(x0);   
    error = abs(x1 - x0);                               
    x0 = x1; 
end

xfinal=x1;  